steps=['▲７六歩', '△８四歩', '▲６八銀', '△３四歩', '▲７七銀', '△６二銀', '▲２六歩', '△４二銀', '▲２五歩', '△３三銀', '▲４八銀', '△３二金', '▲５六歩', '△４一玉', '▲５八金右', '△５二金', '▲７九角', '△７四歩', '▲３六歩', '△５四歩', '▲６六歩', '△３一角', '▲６七金', '△４四歩', '▲６八玉', '△９四歩', '▲９六歩', '△６四角', '▲３七銀', '△３一玉', '▲７八玉', '△４三金右', '▲４六角', '△５三銀', '▲２六銀', '△２二玉', '▲６八金上', '△７三桂', '▲３五歩', '△同歩', '▲同銀', '△３四歩', '▲２六銀', '△６二飛', '▲３七銀', '△４五歩', '▲６四角', '△同歩', '▲８三角', '△６五歩', '▲７四角成', '△８五桂', '▲６五歩', '△７七桂成', '▲同金寄', '△７二飛', '▲６三馬', '△９二飛', '▲６四歩', '△４四銀右', '▲７四馬', '△９三飛', '▲６三歩成', '△９二角', '▲同馬', '△同香', '▲６四と', '△５五歩', '▲６五角', '△５六歩', '▲２四歩', '△同銀', '▲５四と']
import cshogi
import cshogi.KI2 as k

f=open('./record.txt','r')

board=cshogi.Board()
pars=k.Parser()
def trial(a):
    print(a)
    print([cshogi.to_usi(i) for i in  list(board.legal_moves)])
    print(pars.parse_move_str('△４四銀右',board))

    print(a)
for i in steps:
    if i=='△４四銀右':
        trial(board)
    pars.parse_move_str(i,board)
print(board)
